; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v13 ?v5)
             (pred_3 ?v4 ?v2)
             (pred_4 ?v13 ?v2)
             (pred_7 ?v11 ?v13 )
	     (pred_12 ?v13)
             (pred_8 ?v10)
             (pred_5 ?v4)
             (pred_1 ?v2)
             (pred_10 ?v13)
             (pred_11 ?v4)
             (pred_6 ?v13)
             (pred_9 ))



(:action op_2
:parameters (?v3 ?v7 ?v8 ?v9)
:precondition (and (pred_8 ?v3) (pred_8 ?v7) (pred_5 ?v8) (pred_1 ?v9)
          (pred_2 ?v3 ?v7) (pred_3 ?v8 ?v9)
                   (pred_4 ?v7 ?v9) (pred_12 ?v3) 
                   (pred_10 ?v7) (pred_11 ?v8))
:effect (and  (pred_6 ?v7) (not (pred_10 ?v7))))


(:action op_1
:parameters (?v3 ?v1)
:precondition (and (pred_8 ?v3) (pred_8 ?v1)
               (pred_12 ?v3) (pred_2 ?v3 ?v1) (pred_6 ?v1))
:effect (and (pred_12 ?v1) (not (pred_12 ?v3))))

(:action op_3
:parameters (?v3 ?v8)
:precondition (and (pred_8 ?v3) (pred_5 ?v8) 
                  (pred_12 ?v3) (pred_7 ?v8 ?v3) (pred_9 ))
:effect (and (pred_11 ?v8)
   (not (pred_7 ?v8 ?v3)) (not (pred_9 ))))


(:action op_4
:parameters (?v3 ?v6 ?v12)
:precondition (and (pred_8 ?v3) (pred_5 ?v6) (pred_5 ?v12)
                  (pred_12 ?v3) (pred_11 ?v12) (pred_7 ?v6 ?v3))
:effect (and (pred_11 ?v6) (pred_7 ?v12 ?v3)
        (not (pred_11 ?v12)) (not (pred_7 ?v6 ?v3))))

(:action op_5
:parameters (?v3 ?v8)
:precondition (and (pred_8 ?v3) (pred_5 ?v8) 
                  (pred_12 ?v3) (pred_11 ?v8))
:effect (and (pred_9 ) (pred_7 ?v8 ?v3) (not (pred_11 ?v8)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_27 obj_11 obj_05 obj_16 obj_03 obj_10 obj_02 obj_04 obj_08 obj_25 obj_17 obj_12 obj_06 obj_23 obj_07 obj_18 obj_29 obj_24 obj_09 obj_01 obj_31 obj_30 obj_28 obj_26 obj_14
    obj_20 obj_22 obj_13
    obj_15 obj_19 obj_21
    )

    (:init
       (pred_9)

       (pred_8 obj_27)
       (pred_8 obj_11)
       (pred_8 obj_05)
       (pred_8 obj_16)
       (pred_8 obj_03)
       (pred_8 obj_10)
       (pred_8 obj_02)
       (pred_8 obj_04)
       (pred_8 obj_08)
       (pred_8 obj_25)
       (pred_8 obj_17)
       (pred_8 obj_12)
       (pred_8 obj_06)
       (pred_8 obj_23)
       (pred_8 obj_07)
       (pred_8 obj_18)
       (pred_8 obj_29)
       (pred_8 obj_24)
       (pred_8 obj_09)
       (pred_8 obj_01)
       (pred_8 obj_31)
       (pred_8 obj_30)
       (pred_8 obj_28)
       (pred_8 obj_26)
       (pred_8 obj_14)
       (pred_1 obj_20)
       (pred_1 obj_22)
       (pred_1 obj_13)
       (pred_5 obj_15)
       (pred_5 obj_19)
       (pred_5 obj_21)

       (pred_2 obj_27 obj_10)
       (pred_2 obj_27 obj_11)
       (pred_2 obj_11 obj_02)
       (pred_2 obj_11 obj_05)
       (pred_2 obj_11 obj_27)
       (pred_2 obj_05 obj_04)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_05 obj_11)
       (pred_2 obj_16 obj_08)
       (pred_2 obj_16 obj_03)
       (pred_2 obj_16 obj_05)
       (pred_2 obj_03 obj_25)
       (pred_2 obj_03 obj_16)
       (pred_2 obj_10 obj_17)
       (pred_2 obj_10 obj_02)
       (pred_2 obj_10 obj_27)
       (pred_2 obj_02 obj_12)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_11)
       (pred_2 obj_02 obj_10)
       (pred_2 obj_04 obj_06)
       (pred_2 obj_04 obj_08)
       (pred_2 obj_04 obj_05)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_08 obj_23)
       (pred_2 obj_08 obj_25)
       (pred_2 obj_08 obj_16)
       (pred_2 obj_08 obj_04)
       (pred_2 obj_25 obj_07)
       (pred_2 obj_25 obj_03)
       (pred_2 obj_25 obj_08)
       (pred_2 obj_17 obj_18)
       (pred_2 obj_17 obj_12)
       (pred_2 obj_17 obj_10)
       (pred_2 obj_12 obj_29)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_12 obj_02)
       (pred_2 obj_12 obj_17)
       (pred_2 obj_06 obj_24)
       (pred_2 obj_06 obj_23)
       (pred_2 obj_06 obj_04)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_23 obj_09)
       (pred_2 obj_23 obj_07)
       (pred_2 obj_23 obj_08)
       (pred_2 obj_23 obj_06)
       (pred_2 obj_07 obj_01)
       (pred_2 obj_07 obj_25)
       (pred_2 obj_07 obj_23)
       (pred_2 obj_18 obj_31)
       (pred_2 obj_18 obj_29)
       (pred_2 obj_18 obj_17)
       (pred_2 obj_29 obj_30)
       (pred_2 obj_29 obj_24)
       (pred_2 obj_29 obj_12)
       (pred_2 obj_29 obj_18)
       (pred_2 obj_24 obj_28)
       (pred_2 obj_24 obj_09)
       (pred_2 obj_24 obj_06)
       (pred_2 obj_24 obj_29)
       (pred_2 obj_09 obj_26)
       (pred_2 obj_09 obj_01)
       (pred_2 obj_09 obj_23)
       (pred_2 obj_09 obj_24)
       (pred_2 obj_01 obj_14)
       (pred_2 obj_01 obj_07)
       (pred_2 obj_01 obj_09)
       (pred_2 obj_31 obj_30)
       (pred_2 obj_31 obj_18)
       (pred_2 obj_30 obj_28)
       (pred_2 obj_30 obj_29)
       (pred_2 obj_30 obj_31)
       (pred_2 obj_28 obj_26)
       (pred_2 obj_28 obj_24)
       (pred_2 obj_28 obj_30)
       (pred_2 obj_26 obj_14)
       (pred_2 obj_26 obj_09)
       (pred_2 obj_26 obj_28)
       (pred_2 obj_14 obj_01)
       (pred_2 obj_14 obj_26)
       (pred_10 obj_09)
       (pred_10 obj_10)
       (pred_10 obj_23)
       (pred_4  obj_09 obj_20)
       (pred_4  obj_10 obj_22)
       (pred_4  obj_23 obj_13)
       (pred_6 obj_27)
       (pred_6 obj_11)
       (pred_6 obj_05)
       (pred_6 obj_16)
       (pred_6 obj_03)
       (pred_6 obj_02)
       (pred_6 obj_04)
       (pred_6 obj_08)
       (pred_6 obj_25)
       (pred_6 obj_17)
       (pred_6 obj_12)
       (pred_6 obj_06)
       (pred_6 obj_07)
       (pred_6 obj_18)
       (pred_6 obj_29)
       (pred_6 obj_24)
       (pred_6 obj_01)
       (pred_6 obj_31)
       (pred_6 obj_30)
       (pred_6 obj_28)
       (pred_6 obj_26)
       (pred_6 obj_14)

       (pred_3  obj_15 obj_20)
       (pred_3  obj_19 obj_22)
       (pred_3  obj_21 obj_13)
       (pred_7 obj_15 obj_08)
       (pred_7 obj_19 obj_05)
       (pred_7 obj_21 obj_26)
       (pred_12 obj_06)
    )

    (:goal (and
       (pred_7 obj_15 obj_01)
       (pred_7 obj_19 obj_03)
    ))
(:constraints
  (always (not (pred_12 obj_16)))
)
)

; plan
1. (op_1 obj_06 obj_04)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_04)
   goals met: 0 of 2
2. (op_1 obj_04 obj_05)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_05)
   goals met: 0 of 2
3. (op_3 obj_05 obj_19)
   deleted: (pred_7 obj_19 obj_05) (pred_9)
   added: (pred_11 obj_19)
   goals met: 0 of 2
4. (op_1 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 0 of 2
5. (op_1 obj_04 obj_08)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_08)
   goals met: 0 of 2
6. (op_1 obj_08 obj_25)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_25)
   goals met: 0 of 2
7. (op_1 obj_25 obj_03)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_03)
   goals met: 0 of 2
8. (op_5 obj_03 obj_19)
   deleted: (pred_11 obj_19)
   added: (pred_9) (pred_7 obj_19 obj_03)
   goals met: 1 of 2
9. (op_1 obj_03 obj_25)
   deleted: (pred_12 obj_03)
   added: (pred_12 obj_25)
   goals met: 1 of 2
10. (op_1 obj_25 obj_08)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_08)
   goals met: 1 of 2
11. (op_3 obj_08 obj_15)
   deleted: (pred_7 obj_15 obj_08) (pred_9)
   added: (pred_11 obj_15)
   goals met: 1 of 2
12. (op_1 obj_08 obj_25)
   deleted: (pred_12 obj_08)
   added: (pred_12 obj_25)
   goals met: 1 of 2
13. (op_1 obj_25 obj_07)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_07)
   goals met: 1 of 2
14. (op_1 obj_07 obj_01)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_01)
   goals met: 1 of 2
15. (op_5 obj_01 obj_15)
   deleted: (pred_11 obj_15)
   added: (pred_9) (pred_7 obj_15 obj_01)
   goals met: 2 of 2
